# Busquedas en Arrays y documentos anidados 

## Buscar dentro de un documento anidado

db1> db.ciudades.find({alcalde:{nombre:"Crystal",apellidos:"Long",edad:76}})

db1> db.ciudades.find({"alcalde.nombre":"Crystal"})

1. Seleccionar las ciudades donde los alcaldes tengan mas de 70 anios

db1> db.ciudades.find({"alcalde.edad":{$gt:70}})

2. Realizar la consulta anterior pero utilizando una proyeccion

db1> db.ciudades.find({"alcalde.edad":{$gt:70}},{_id:0,nombre:1,"alcalde.edad":1})

3. Seleccionar las ciudades donde el alcalde tenga 76 anos o 41

db1> db.ciudades.find({$or:[{"alcalde.edad":76,"alcalde.edad":41}]})

## Consultas con Arrays

1. Crear una coleccion cazas
2. Cargar los documentos de la coleccion cazas, de la data cazas


## Ejemplos con consulta con Arrays

1. Buscar los documentos que tengan USA

db1> db.cazas.find({paises:"usa"})

2. Buscar los documentos donde cualquier elemento del array dimensiones sea mayor a 5

db1> db.cazas.find({dimensiones:{$gt:5}})

3. Buscar los documentos donde las dimensiones del avion por ancho que es la posicion 1 sea superior a 14

db.cazas.find({"dimensiones.1":{$gt:14}})

db1> db.cazas.find({"dimensiones.1":{$gt:14}},{_id:0,dimensiones:1,model:1})

## Arrays , Operador $all

1. Buscar los aviones que estan sirviendo en egipto y en israel

db1> db.cazas.find({paises:{$all:['egipto','israel']}},{_id:0,modelo:1,paises:1})

db.cazas.find([{$and{paises:"egipto",paises:"israel"},{}])


2. Seleccionar los cazas que sirven en inglaterra y espana

db.cazas.find({$and:[{paises:"inglaterra"},{paises:"espaÃ±a"}]})

## Arrays operador $elementMatch ->  permite hacer busquedas dentro de arrays este busca la lista de condiciones que entan dentro del operador 

1. Buscar que aviones tienen dentro de inglaterra
db.cazas.find({ paises: { $elemMatch: { $eq: "inglaterra" } } })


2. Buscar los aviones donde las dimensiones sean menores a 20 o mayores a 15

db.cazas.find({ dimensiones: { $elemMatch: { $lt: 20, $gt:15} } })

## Buscar en arrays de documentos anidados

1. Utilizar la coleccion ciudades
2. Buscar los consejeros de nombre Jeri Flower de edad 78

db1> db.ciudades.find({consejeros:{identificador:1,nombre:"Jeri Flowers",edad:78}})

3. Buscar en consejeros donde tengan una edad mayor a 70

db1> db.ciudades.find({"consejeros.edad":{$gt:70}})

4. Buscar en consejeros en la posicion 2 que esten entre 70 y 80 anios

db1> db.ciudades.find({"consejeros.2.edad":{$gt:70, $lt:80}},{_id:0,"consejeros.edad":1,"consejeros.nombre":1})

5. Buscar los consejeros de la posicion 0 que sean mayores a 70

db.ciudades.find({"consejeros.0.edad":{$gt:70}},{_id:0,"consejeros.edad":1,"alcalde.nombre":1, "alcalde.edad":1})

6. Buscar los consejeros que sean mayores a 70

db.ciudades.find({"consejeros.edad":{$gt:70}},{_id:0,"consejeros.edad":1,"consejeros.nombre":1})
